Revit 2026 API

# TrussMemberInfo Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TrussMemberInfo()
```
```vb
Public Sub New
```
```cpp
public:
TrussMemberInfo()
```
```fsharp
new : unit -> TrussMemberInfo
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

TrussMemberInfo Class

Autodesk.Revit.DB.Structure Namespace